In [1]:
import pandas as pd

In [4]:
## series 
## A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a list or an array in Python.   

import pandas as pd 
data = [1,2,3,4,6]
series = pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    6
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
## Create a Series from dictionary
data = {'a' : 0., 'b' : 1., 'c' : 2.}
series_dict = pd.Series(data)
print(series_dict)

a    0.0
b    1.0
c    2.0
dtype: float64

In [8]:
data = [10, 20, 30, 40, 50]
index = ['a', 'b', 'c', 'd', 'e']
pd.Series(data, index=index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [10]:
## DataFrame 
## create a dataframe from a dictionary of lists 

data = {
    'Name':['Tom', 'nick', 'krish', 'jack'],
    'Age':[20, 21, 19, 18],
    'City':['New York', 'New York', 'Los Angeles', 'Los Angeles']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age         City
0    Tom   20     New York
1   nick   21     New York
2  krish   19  Los Angeles
3   jack   18  Los Angeles
<class 'pandas.core.frame.DataFrame'>

In [11]:
import numpy as np
np.array(df)

array([['Tom', 20, 'New York'],
       ['nick', 21, 'New York'],
       ['krish', 19, 'Los Angeles'],
       ['jack', 18, 'Los Angeles']], dtype=object)

In [21]:
## create a Data frame from a list of Dictionaries 

data = [
    {'Name':'Tom', 'Age':20, 'City':'New York'},
    {'Name':'nick', 'Age':21, 'City':'New York'},
    {'Name':'krish', 'Age':19, 'City':'Los Angeles'},
    {'Name':'jack', 'Age':18, 'City':'Los Angeles'}
]

df = pd.DataFrame(data)
print(df)

    Name  Age         City
0    Tom   20     New York
1   nick   21     New York
2  krish   19  Los Angeles
3   jack   18  Los Angeles

In [16]:
df = pd.read_csv('sales_data.csv')

In [17]:
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [22]:
## Accessing data frame dataframes
data

[{'Name': 'Tom', 'Age': 20, 'City': 'New York'},
 {'Name': 'nick', 'Age': 21, 'City': 'New York'},
 {'Name': 'krish', 'Age': 19, 'City': 'Los Angeles'},
 {'Name': 'jack', 'Age': 18, 'City': 'Los Angeles'}]

In [23]:
df

    Name  Age         City
0    Tom   20     New York
1   nick   21     New York
2  krish   19  Los Angeles
3   jack   18  Los Angeles

In [25]:
df['Name']

0      Tom
1     nick
2    krish
3     jack
Name: Name, dtype: object

In [26]:
type(df['Name'])

pandas.core.series.Series

In [27]:
df.loc[0]

Name         Tom
Age           20
City    New York
Name: 0, dtype: object

In [30]:
df.iloc[0]

Name         Tom
Age           20
City    New York
Name: 0, dtype: object

In [32]:
## Accessing a specified element
df['Name']

0      Tom
1     nick
2    krish
3     jack
Name: Name, dtype: object

In [34]:
## accessing a specified elements
df.at[1, 'Age']

21

In [35]:
df.iat[2,2]

'Los Angeles'

In [36]:
### data manipulation with dataframes
df

    Name  Age         City
0    Tom   20     New York
1   nick   21     New York
2  krish   19  Los Angeles
3   jack   18  Los Angeles

In [37]:
df['Salary'] = [1000, 2000, 3000, 4000]
df

    Name  Age         City  Salary
0    Tom   20     New York    1000
1   nick   21     New York    2000
2  krish   19  Los Angeles    3000
3   jack   18  Los Angeles    4000

In [39]:
## Remove a column
df.drop('Salary', axis=1,inplace = True)

In [40]:
df

    Name  Age         City
0    Tom   20     New York
1   nick   21     New York
2  krish   19  Los Angeles
3   jack   18  Los Angeles

In [41]:
## add age to the column
df['Age'] = df['Age'] + 10

In [42]:
df

    Name  Age         City
0    Tom   30     New York
1   nick   31     New York
2  krish   29  Los Angeles
3   jack   28  Los Angeles

In [43]:
df.drop(0,inplace=True)

In [44]:
df

    Name  Age         City
1   nick   31     New York
2  krish   29  Los Angeles
3   jack   28  Los Angeles

In [52]:
df = pd.read_csv('sales_data.csv')

In [53]:
# Display the data type of each column
print("Data types:\n", df.dtypes)

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [54]:
# Describe the dataframe
print("Description:\n", df.describe())

Description:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [58]:
# group by a column and perform an aggregation function
# Display the column names to check for the correct column name
print(df.columns)
grouped = df.groupby('Product Category')['Total Revenue'].mean()

Index(['Transaction ID', 'Date', 'Product Category', 'Product Name',
       'Units Sold', 'Unit Price', 'Total Revenue', 'Region',
       'Payment Method'],
      dtype='object')

In [59]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000